stress-test/scenario-test-config.yaml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 30  #30초 동안 지속
      arrivalRate: 3  #초당 3개의 요청이 발생
      name: Warm up  #
    - duration: 30
      arrivalRate: 3
      rampTo: 30  #30초 동안 요청 속도가 점진적으로 초당 30개로 증가
      name: Ramp up load
    - duration: 60
      arrivalRate: 30  #초당 30개의 요청 발생
      name: Sustained load
    - duration: 30
      arrivalRate: 30
      rampTo: 10  #30초 동안 요청속도가 점차 줄어들어 초당 10개로 감소
      name: End of load
scenarios:
  - name: "login and use some functions"
    flow:
      - post:
          url: "/login"
      - get:
          url: "/some-function-one"
      - get:
          url: "/some-function-two"
  - name: "just login"
    flow:
      - post:
          url: "/login"